app/controllers/lists_controller.rb

  def create
    list = current_user.lists.build(list_params)
    if list.save
---
INSERT INTO "lists" ("name", "user_id") VALUES ($1, $2) RETURNING "id"  [["name", "Test"], ["user_id", 44]]

  def update
    list = current_user.lists.find_by_id(params[:id])
    if list.nil?
      render_error(list)
    else
      list.update(list_params)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."user_id" = $1 AND "lists"."id" = $2  ORDER BY "lists"."id" ASC LIMIT 1  [["user_id", 75], ["id", 26]]
UPDATE "lists" SET "name" = $1 WHERE "lists"."id" = $2  [["name", "Test"], ["id", 22]]

  def destroy
    list = current_user.lists.find_by_id(params[:id])
    if list.nil?
      render_error(list)
    else
      list.destroy
---
SELECT  "lists".* FROM "lists" WHERE "lists"."user_id" = $1 AND "lists"."id" = $2 LIMIT 1  [["user_id", 123], ["id", 1]]
DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 49]]

  def show
    list = current_user.lists.find_by_id(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."user_id" = $1 AND "lists"."id" = $2  ORDER BY "lists"."id" ASC LIMIT 1  [["user_id", 23], ["id", 3]]