app/controllers/products_controller.rb

  def create
    product = current_user.products.build(product_params)
    if product.save
---
INSERT INTO "products" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Test"], ["user_id", 145], ["created_at", "2017-05-13 18:17:39.022369"], ["updated_at", "2017-05-13 18:17:39.022369"]]

  def update
    product = current_user.products.find_by_id(params[:id])
    if product.nil?
      render_error(product)
    else
      product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."user_id" = $1 AND "products"."id" = $2 LIMIT 1  [["user_id", 116], ["id", 5]]
UPDATE "products" SET "name" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["name", "Test List"], ["updated_at", "2017-05-13 18:16:38.218075"], ["id", 6]]

  def destroy
    product = current_user.products.find_by_id(params[:id])
    if product.nil?
      render_error(product)
    else
      product.destroy
---
SELECT  "products".* FROM "products" WHERE "products"."user_id" = $1 AND "products"."id" = $2 LIMIT 1  [["user_id", 120], ["id", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 44]]

  def show
    product = current_user.products.find_by_id(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."user_id" = $1 AND "products"."id" = $2 LIMIT 1  [["user_id", 110], ["id", 1]]